demoelectric/app/Controllers/CustomerAccounts.php

SELECT COUNT(*) AS `numrows`
FROM `customer_accounts`
SELECT COUNT(*) AS `numrows`
FROM `customer_accounts`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `customer_accounts`
WHERE `status` = 'inactive'
SELECT COUNT(*) AS `numrows`
FROM `customer_accounts`
WHERE `status` = 'suspended'
---
    public function index(): string
    {
        $search = trim((string) $this->request->getGet('search'));
        $status = trim((string) $this->request->getGet('status'));
        $type = trim((string) $this->request->getGet('type'));

        if ($search !== '') {
            $this->accounts->groupStart()
                ->like('account_number', $search)
                ->orLike('customer_name', $search)
                ->orLike('email', $search)
                ->orLike('phone', $search)
                ->groupEnd();
        }
        if ($status !== '') {
            $this->accounts->where('status', $status);
        }
        if ($type !== '') {
            $this->accounts->where('connection_type', $type);
        }

        $accounts = $this->accounts->orderBy('created_at', 'DESC')->paginate(10);
        $stats = new CustomerAccountModel();

        return view('dashboard/index', [
            'title' => 'Customer Dashboard',
            'accounts' => $accounts,
            'pager' => $this->accounts->pager,
            'totalAccounts' => $stats->countAllResults(),
            'activeAccounts' => (new CustomerAccountModel())->where('status', 'active')->countAllResults(),
            'inactiveAccounts' => (new CustomerAccountModel())->where('status', 'inactive')->countAllResults(),
            'suspendedAccounts' => (new CustomerAccountModel())->where('status', 'suspended')->countAllResults(),