demoelectric/app/Controllers/CustomerAuth.php

SELECT *
FROM `customer_accounts`
WHERE `username` = 'Rovic'
 LIMIT 1
---
    public function attempt()
    {
        if (! $this->validate(['username' => 'required', 'password' => 'required'])) {
            return redirect()->back()->withInput()->with('error', 'Enter both your username and password.');
        }

        $customer = (new CustomerAccountModel())
            ->where('username', trim((string) $this->request->getPost('username')))
            ->first();

SELECT *
FROM `customer_accounts`
WHERE `customer_accounts`.`id` = 28
---
    public function account(): string
    {
        $customer = (new CustomerAccountModel())->find((int) session()->get('customerId'));